In [1]:
import pandas as p

In [13]:
p.read_csv('abhisinghal2.tsv',sep='\t')

     name       mobile     city
0    abhi   9999999999    noida
1    sonu   8988888888    delhi
2   deepa   7777777777  kolkata
3  mukesh   6666666666    patna
4   sonal  55555555555    bihar